# Data Aggregation and Group Operation

## GroupBy Mechanicsm

- ___At first process data of pandas object on a particular axis of an object. for example DataFrame can be grouped on its row (axios=0) or its column (axis=1)___
- ___Once function can be applied producing new vaue, and finally the result of all those functions applications are combined into a result object___
- ___The form of result object will usaully depend on what's being done to the data__
- ___For example___

In [3]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame({
                  'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],
                  'data1' : np.random.randn(5), 'data2' : np.random.randn(5)
                  })
df

  key1 key2     data1     data2
0    a  one -0.272038 -2.362202
1    a  two  2.331146 -0.011117
2    b  one  1.501601 -0.585135
3    b  two  0.270461  1.049894
4    a  one -1.048512 -1.800031

- ___Let's say you wanted to compute the mean of data1 column using the labels from key1___

In [22]:
grouped = df['data1'].groupby(df['key1'])
grouped

- ___This 'grouped' variable is now GroupBy object it has not computed anything yet exxept intermediate data about the group
key df['key1']___
- ___But this object has all the information that is needed to apply some operation to each group___

In [16]:
grouped.mean()

key1
a    0.336866
b    0.886031
Name: data1, dtype: float64

- __Lets pass multiple keyword in groupby function__

In [30]:
grouped2 = df['data1'].groupby([df['key1'], df['key2']])
grouped2.mean()

key1  key2
a     one    -0.660275
      two     2.331146
b     one     1.501601
      two     0.270461
Name: data1, dtype: float64

- ___OR___

In [28]:
grouped2 = df['data1'].groupby([df['key1'], df['key2']])
grouped2.sum()

key1  key2
a     one    -1.320549
      two     2.331146
b     one     1.501601
      two     0.270461
Name: data1, dtype: float64

In [31]:
grouped2 = df['data1'].groupby([df['key1'], df['key2']])
grouped2.size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
Name: data1, dtype: int64

- ___In this example, the group keys are all Series, though they could be any arrays of the right length___

In [33]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005    2.331146
            2006    1.501601
Ohio        2005   -0.000788
            2006   -1.048512
Name: data1, dtype: float64

## Iterating Over Groups

- __GroupBy objects support the itertion__
- __It generate a sequence of 2-tuples containing th group name along with the chunk of data__

In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame({
                  'key1' : ['a', 'a', 'b', 'b', 'a'], 'key2' : ['one', 'two', 'one', 'two', 'one'],
                  'data1' : np.random.randn(5), 'data2' : np.random.randn(5)
                  })
df

  key1 key2     data1     data2
0    a  one -0.923382  0.461537
1    a  two  1.466361 -0.534668
2    b  one -1.478567 -0.307821
3    b  two -2.320617  0.154277
4    a  one  1.569417 -0.476180

In [9]:
for name,group in df.groupby('key1'):
    print("Name : ",name)
    print("Group : ",group)

Name :  a
Group :    key1 key2     data1     data2
0    a  one  1.260131 -0.616026
1    a  two  0.655671 -0.453474
4    a  one -0.635110  0.248737
Name :  b
Group :    key1 key2     data1     data2
2    b  one  0.979849  1.610186
3    b  two -1.649056 -0.467272

- __In the case of multiple keys__

In [4]:
for name,group in df.groupby(['key1','key2']):
    print("Name : ",name)
    print("Group : ",group)

Name :  ('a', 'one')
Group :    key1 key2     data1     data2
0    a  one -0.923382  0.461537
4    a  one  1.569417 -0.476180
Name :  ('a', 'two')
Group :    key1 key2     data1     data2
1    a  two  1.466361 -0.534668
Name :  ('b', 'one')
Group :    key1 key2     data1     data2
2    b  one -1.478567 -0.307821
Name :  ('b', 'two')
Group :    key1 key2     data1     data2
3    b  two -2.320617  0.154277

- __you can choose to do whatever you want with the pieces of data__

In [18]:
pieces = list(df.groupby('key1'))
pieces

[('a',
    key1 key2     data1     data2
  0    a  one  1.260131 -0.616026
  1    a  two  0.655671 -0.453474
  4    a  one -0.635110  0.248737),
 ('b',
    key1 key2     data1     data2
  2    b  one  0.979849  1.610186
  3    b  two -1.649056 -0.467272)]

In [20]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

## Selecting a Column or Subset of Columns

- __For example, in the preceding dataset, to compute means for just the data2 column and
get the result as a DataFrame, we could write:__

In [28]:
s_grouped = df.groupby(['key1', 'key2'])[['data2']]
s_grouped.mean()

              data2
key1 key2
a    one  -0.183644
     two  -0.453474
b    one   1.610186
     two  -0.467272

In [29]:
s2_grouped = df.groupby(['key1', 'key2'])[['data1']]
s2_grouped.mean()

              data1
key1 key2
a    one   0.312510
     two   0.655671
b    one   0.979849
     two  -1.649056

## Grouping with Dicts and Series

- __Grouping informaiton may exist in a form other than an array. Let's consider another example DataFrame__

In [5]:
people = pd.DataFrame(np.random.randn(5, 5), 
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis']
                     )
people

               a         b         c         d         e
Joe     0.989581 -0.907333  0.828587 -0.099848  0.310752
Steve  -0.290156 -0.617005 -0.006321 -2.261704 -1.227214
Wes     0.728232  1.818660 -1.580254 -0.598029  0.721285
Jim     1.085230  0.547672  0.059699 -0.175725  0.509656
Travis  1.326031  0.171800 -0.651946 -2.105351  1.710498

In [7]:
people.iloc[2:3,[1,2]] = np.nan # Add few Na values
people

               a         b         c         d         e
Joe     0.989581 -0.907333  0.828587 -0.099848  0.310752
Steve  -0.290156 -0.617005 -0.006321 -2.261704 -1.227214
Wes     0.728232       NaN       NaN -0.598029  0.721285
Jim     1.085230  0.547672  0.059699 -0.175725  0.509656
Travis  1.326031  0.171800 -0.651946 -2.105351  1.710498

- __Now suppose i have a group correspondence for the columns and want to sum together to columns by group__

In [8]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

- __Now, we could construct an array fro this dict to pass to groupby, but instead we can
just pass the dict__

In [10]:
by_column = people.groupby(mapping, axis=1)
by_column.mean()

            blue       red
Joe     0.364370  0.131000
Steve  -1.134013 -0.711459
Wes    -0.598029  0.724759
Jim    -0.058013  0.714186
Travis -1.378648  1.069443

In [23]:
by_column.count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

- __The same functionality holds for Series, which can be viewed as a fixed-size mapping__

In [15]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [21]:
series_by_column = people.groupby(map_series, axis=1)
series_by_column.count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [22]:
series_by_column.mean()

            blue       red
Joe     0.364370  0.131000
Steve  -1.134013 -0.711459
Wes    -0.598029  0.724759
Jim    -0.058013  0.714186
Travis -1.378648  1.069443

## Grouping with Functions